benemorius/RIOT/pkg/mcux_kw41z/contrib/fsl_os_abstraction_riot.c
typedef uint8_t appHostMsgType_t;

/* Host to Application Connection Message */
typedef struct connectionMsg_tag{
    deviceId_t              deviceId;
    gapConnectionEvent_t    connEvent;
}connectionMsg_t;

/* Host to Application GATT Server Message */
typedef struct gattServerMsg_tag{
    deviceId_t          deviceId;
    gattServerEvent_t   serverEvent;
}gattServerMsg_t;

/* Host to Application GATT Client Procedure Message */
typedef struct gattClientProcMsg_tag{
    deviceId_t              deviceId;
    gattProcedureType_t     procedureType;
    gattProcedureResult_t   procedureResult;
    bleResult_t             error;
}gattClientProcMsg_t;

/* Host to Application GATT Client Notification/Indication Message */
typedef struct gattClientNotifIndMsg_tag{
    uint8_t*    aValue;
    uint16_t    characteristicValueHandle;
    uint16_t    valueLength;
    deviceId_t  deviceId;
}gattClientNotifIndMsg_t;

/* L2ca to Application Data Message */
typedef struct l2caLeCbDataMsg_tag{
    deviceId_t  deviceId;
    uint16_t    lePsm;
    uint16_t    packetLength;
    uint8_t     aPacket[0];
}l2caLeCbDataMsg_t;

/* L2ca to Application Control Message */
typedef struct l2caLeCbControlMsg_tag{
    l2capControlMessageType_t   messageType;
    uint16_t                    padding;
    uint8_t                     aMessage[0];
}l2caLeCbControlMsg_t;

typedef struct appMsgFromHost_tag{
    appHostMsgType_t    msgType;
    union {
        gapGenericEvent_t       genericMsg;
        gapAdvertisingEvent_t   advMsg;
        connectionMsg_t         connMsg;
        gapScanningEvent_t      scanMsg;
        gattServerMsg_t         gattServerMsg;
        gattClientProcMsg_t     gattClientProcMsg;
        gattClientNotifIndMsg_t gattClientNotifIndMsg;
        l2caLeCbDataMsg_t       l2caLeCbDataMsg;
        l2caLeCbControlMsg_t    l2caLeCbControlMsg;
    } msgData;
}appMsgFromHost_t;

// typedef PACKED_STRUCT hardwareParameters_tag
// {
//     uint8_t  identificationWord[10];   /* valid data present */
//     uint8_t  reserved[16];             /* for backward compatibillity */
//     uint8_t  zbInstallCode[16];        /* Install code used for joining to a Zigbee network as specified in the Base Device Behavior spec.
//                                           A value of all FFs means that a value defined in the application will be used. */
//     uint8_t  ieee_802_15_4_address[8]; /* IEEE 802.15.4 MAC address */
//     uint8_t  bluetooth_address[6];     /* Bluetooth address */
//     uint32_t xtalTrim;                 /* KW4x only */
//     uint32_t edCalibrationOffset;      /* KW01 ED offset */
//     uint32_t pllFStepOffset;           /* KW01 fine tune pll */
//     uint32_t gInternalStorageAddr;     /* The start address of the internal storage used for OTA update.
//                                           A value of 0xFFFFFFFF means that the External storage is used.
//                                           Warning: The offset to this field in respect to the start address of the structure
//                                           must not be changed.*/
//     /* For forward compatibility additional fields may be added here
//        Existing data in flash will not be compatible after modifying the hardwareParameters_t typedef*/
//     uint16_t hardwareParamsCrc;        /* crc for data between start of reserved area and start of hardwareParamsCrc field (not included). */
// }hardwareParameters_t;

/*! *********************************************************************************
*************************************************************************************
* Public functions
*************************************************************************************
********************************************************************************** */

// hardwareParameters_t gHardwareParameters;

extern bool_t gMCUSleepDuringBleEvents;

inline void panic(uint32_t id, uint32_t location, uint32_t extra1, uint32_t extra2)
{
    (void)id;
    (void)location;
    (void)extra1;
    (void)extra2;

    assert(0);
}

bleResult_t Ble_Initialize(gapGenericCallback_t gapGenericCallback)
{
    /* BLE Radio Init */
    XCVR_Init(BLE_MODE, DR_1MBPS);
    XCVR_SetXtalTrim( (uint8_t)gHardwareParameters.xtalTrim );

    if (osaStatus_Success != Controller_TaskInit())
    {
        return gBleOsError_c;
    }

    gMCUSleepDuringBleEvents = cMCU_SleepDuringBleEvents;

    /* BLE Controller Init */
    if (osaStatus_Success != Controller_Init(Hcit_SendPacket))
    {
        return gBleOsError_c;
    }

    return 0;
}

/* Called by BLE when a connect is received */
static void BLE_SignalFromISRCallback(void)
{
//     printf("ISR\n");
//     PWR_DisallowDeviceToSleep();
}

void main_task(void *param)
{
    uint8_t pseudoRNGSeed[20] = {0};

    /* Framework init */
    MEM_Init();
    TMR_Init();
//     LED_Init();
    SecLib_Init();

    RNG_Init();
    RNG_GetRandomNo((uint32_t*)(&(pseudoRNGSeed[0])));
    RNG_GetRandomNo((uint32_t*)(&(pseudoRNGSeed[4])));
    RNG_GetRandomNo((uint32_t*)(&(pseudoRNGSeed[8])));
    RNG_GetRandomNo((uint32_t*)(&(pseudoRNGSeed[12])));
    RNG_GetRandomNo((uint32_t*)(&(pseudoRNGSeed[16])));
    RNG_SetPseudoRandomNoSeed(pseudoRNGSeed);

#if gAppUseNvm_d
    /* Initialize NV module */
    NvModuleInit();
#endif

#if !gUseHciTransportDownward_d
    pfBLE_SignalFromISR = BLE_SignalFromISRCallback;
#endif /* !gUseHciTransportDownward_d */

#if (cPWR_UsePowerDownMode || gAppUseNvm_d)
#if (!mAppIdleHook_c)
//     AppIdle_TaskInit();
#endif
#endif

#if (cPWR_UsePowerDownMode)
//     PWR_Init();
#endif

    /* Initialize peripheral drivers specific to the application */
//     BleApp_Init();

    /* Create application event */
    mAppEvent = OSA_EventCreate(TRUE);
    if( NULL == mAppEvent )
    {
        panic(0,0,0,0);
        return;
    }

    /* Prepare application input queue.*/
    MSG_InitQueue(&mHostAppInputQueue);

    /* Prepare callback input queue.*/
    MSG_InitQueue(&mAppCbInputQueue);

