benemorius/RIOT/pkg/mcux_kw41z/contrib/fsl_os_abstraction_riot.c
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreDestroy
 * Description   : This function is used to destroy a semaphore.
 * Return        : osaStatus_Success if the semaphore is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreDestroy(osaSemaphoreId_t semId)
{
  DEBUG("sema destroy\n");
#if osNumberOfSemaphores
  semaphore_t *sem = (semaphore_t *)semId;
  if(sem == NULL)
  {
    return osaStatus_Error;
  }
  sema_destroy(sem);
  return osaStatus_Success;
#else
  (void)semId;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphoreWait
 * Description   : This function checks the semaphore's counting value, if it is
 * positive, decreases it and returns osaStatus_Success, otherwise, timeout
 * will be used for wait. The parameter timeout indicates how long should wait
 * in milliseconds. Pass osaWaitForever_c to wait indefinitely, pass 0 will
 * return osaStatus_Timeout immediately if semaphore is not positive.
 * This function returns osaStatus_Success if the semaphore is received, returns
 * osaStatus_Timeout if the semaphore is not received within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphoreWait(osaSemaphoreId_t semId, uint32_t millisec)
{
  DEBUG("sema wait\n");
#if osNumberOfSemaphores
  if(semId == NULL)
  {
    return osaStatus_Error;
  }
  semaphore_t *sem = (semaphore_t *)semId;
  int res = 0;

  /* Convert timeout from millisecond to tick. */
  if (millisec == osaWaitForever_c)
  {
    res = sema_wait(sem);
  }
  else
  {
    res = sema_wait_timed(sem, millisec * US_PER_MS);
  }

  if (res)
  {
    return osaStatus_Timeout; /* timeout */
  }
  else
  {
    return osaStatus_Success; /* semaphore taken */
  }

#else
  (void)semId;
  (void)millisec;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_SemaphorePost
 * Description   : This function is used to wake up one task that wating on the
 * semaphore. If no task is waiting, increase the semaphore. The function returns
 * osaStatus_Success if the semaphre is post successfully, otherwise returns
 * osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_SemaphorePost(osaSemaphoreId_t semId)
{
    DEBUG("sema post\n");
#if osNumberOfSemaphores
    if(!semId)
    {
        return osaStatus_Error;
    }

    return sema_post((semaphore_t *)semId);

#else
    (void)semId;
    return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexCreate
 * Description   : This function is used to create a mutex.
 * Return        : Mutex handle of the new mutex, or NULL if failed.
 *
 *END**************************************************************************/
osaMutexId_t OSA_MutexCreate(void)
{
    DEBUG("mutex create\n");
#if osNumberOfMutexes
    static mutex_t mutex;
    mutex_init(&mutex);
    return (osaMutexId_t)&mutex;
#else
    return NULL;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexLock
 * Description   : This function checks the mutex's status, if it is unlocked,
 * lock it and returns osaStatus_Success, otherwise, wait for the mutex.
 * This function returns osaStatus_Success if the mutex is obtained, returns
 * osaStatus_Error if any errors occur during waiting. If the mutex has been
 * locked, pass 0 as timeout will return osaStatus_Timeout immediately.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexLock(osaMutexId_t mutexId, uint32_t millisec)
{
    DEBUG("mutex lock\n");
#if osNumberOfMutexes
    mutex_t *mutex = (mutex_t *)mutexId;
    if(mutexId == NULL)
    {
     return osaStatus_Error;
    }

    int res = 0;

    /* Convert timeout from millisecond to tick. */
    if (millisec == osaWaitForever_c)
    {
        res = mutex_trylock(mutex);
    }
    else
    {
        res = mutex_trylock(mutex);
    }

    if (!res)
    {
        return osaStatus_Timeout; /* timeout */
    }
    else
    {
        return osaStatus_Success; /* semaphore taken */
    }
#else
    (void)mutexId;
    (void)millisec;
    return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexUnlock
 * Description   : This function is used to unlock a mutex.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexUnlock(osaMutexId_t mutexId)
{
    DEBUG("mutex unlock\n");
#if osNumberOfMutexes
  mutex_t *mutex = (mutex_t *)mutexId;
  if(mutexId == NULL)
  {
    return osaStatus_Error;
  }

  mutex_unlock(mutex);

  return osaStatus_Success;

#else
  (void)mutexId;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MutexDestroy
 * Description   : This function is used to destroy a mutex.
 * Return        : osaStatus_Success if the lock object is destroyed successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_MutexDestroy(osaMutexId_t mutexId)
{
    DEBUG("mutex destroy\n");
#if osNumberOfMutexes
  if(mutexId == NULL)
  {
    return osaStatus_Error;
  }

  return osaStatus_Success;
#else
  (void)mutexId;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventCreate
 * Description   : This function is used to create a event object.
 * Return        : Event handle of the new event, or NULL if failed.
 *
 *END**************************************************************************/
osaEventId_t OSA_EventCreate(bool_t autoClear)
{
    DEBUG("event create\n");
#if osNumberOfEvents
    osaEventId_t eventId;
    osEventStruct_t* pEventStruct;
    OSA_InterruptDisable();
    eventId = pEventStruct = osObjectAlloc(&osEventInfo);
    OSA_InterruptEnable();
    if(eventId == NULL)
    {
        return NULL;
    }

    pEventStruct->event.flags = 0;
    pEventStruct->event.autoClear = autoClear;

    DEBUG("create 0x%lx autoclear: %i\n", (uint32_t)eventId, autoClear);

    return eventId;
#else
  (void)autoClear;
  return NULL;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventSet
 * Description   : Set one or more event flags of an event object.
 * Return        : osaStatus_Success if set successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventSet(osaEventId_t eventId, osaEventFlags_t flagsToSet)
{
//     DEBUG("set 0x%lx flags: 0x%08lx\n", (uint32_t)eventId, flagsToSet);

#if osNumberOfEvents

    /* thread_flags_set() is limited to 16 bits */
    assert(!(flagsToSet & 0xffff0000));

    osEventStruct_t *pEventStruct = (osEventStruct_t*)eventId;

    unsigned irq = irq_disable();

