benemorius/RIOT/pkg/mcux_kw41z/contrib/fsl_os_abstraction_riot.c
    pEventStruct->event.flags |= flagsToSet;

    for (int i = 0; i < 31; i++) {
        if (pEventStruct->event.threads & (1 << i)) {
//             DEBUG("thread %u\n", i);
            thread_flags_set((thread_t *)thread_get(i), flagsToSet);
        }
    }

    irq_restore(irq);

    return osaStatus_Success;

#else
  (void)eventId;
  (void)flagsToSet;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventClear
 * Description   : Clear one or more event flags of an event object.
 * Return        :osaStatus_Success if clear successfully, osaStatus_Error if failed.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventClear(osaEventId_t eventId, osaEventFlags_t flagsToClear)
{
#if osNumberOfEvents
  return osaStatus_Success;
#else
  (void)eventId;
  (void)flagsToClear;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventWait
 * Description   : This function checks the event's status, if it meets the wait
 * condition, return osaStatus_Success, otherwise, timeout will be used for
 * wait. The parameter timeout indicates how long should wait in milliseconds.
 * Pass osaWaitForever_c to wait indefinitely, pass 0 will return the value
 * osaStatus_Timeout immediately if wait condition is not met. The event flags
 * will be cleared if the event is auto clear mode. Flags that wakeup waiting
 * task could be obtained from the parameter setFlags.
 * This function returns osaStatus_Success if wait condition is met, returns
 * osaStatus_Timeout if wait condition is not met within the specified
 * 'timeout', returns osaStatus_Error if any errors occur during waiting.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventWait(osaEventId_t eventId, osaEventFlags_t flagsToWait, bool_t waitAll, uint32_t millisec, osaEventFlags_t *pSetFlags)
{
//     DEBUG("wait 0x%lx pid: %u flags: 0x%lx msec: 0x%lx\n", (uint32_t)eventId,
//            thread_getpid(), flagsToWait, millisec);

#if osNumberOfEvents
    osEventStruct_t* pEventStruct;
    uint32_t flagsSave;
    if(osObjectIsAllocated(&osEventInfo, eventId) == false)
    {
        return osaStatus_Error;
    }

    /* Clean FreeRTOS cotrol flags */
    flagsToWait = flagsToWait & 0xFFFF;

    pEventStruct = (osEventStruct_t*)eventId;

    unsigned irq = irq_disable();
    pEventStruct->event.threads |= 1 << thread_getpid();

    if ((pEventStruct->event.flags & flagsToWait) == 0)
    {
        irq_restore(irq);
        xtimer_t timeout;
        if (millisec != osaWaitForever_c)
        {
//             DEBUG("wake after %lu ms\n", millisec);
            xtimer_set_timeout_flag(&timeout, millisec * US_PER_MS);
        }
//         thread_flags_clear(0xffffffff);
        uint32_t f = thread_flags_wait_any(flagsToWait);
        (void)f;
//         DEBUG("woke %u flags 0x%lx\n", thread_getpid(), f);
        xtimer_remove(&timeout);
        irq = irq_disable();
    } else {
//         DEBUG("no sleep %i\n", thread_getpid());
    }


    flagsSave = pEventStruct->event.flags & flagsToWait;

//     if (flagsSave == 0) {
//         flagsSave = 0x1;
//     }

    if (flagsSave == 0) {
        irq_restore(irq);
        return osaStatus_Timeout;
    }

    pEventStruct->event.threads &= ~(1UL << thread_getpid());

//     DEBUG("flags 0x%lx\n", flagsSave);

    if (pEventStruct->event.autoClear) {
        pEventStruct->event.flags &= ~(flagsSave);
        thread_flags_clear(flagsSave);
    }

    irq_restore(irq);

    if(pSetFlags) {
        *pSetFlags = flagsSave;
    }

    if (flagsSave) {
        return osaStatus_Success;
    } else {
        return osaStatus_Timeout;
    }

#else
  (void)eventId;
  (void)flagsToWait;
  (void)waitAll;
  (void)millisec;
  (void)pSetFlags;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_EventDestroy
 * Description   : This function is used to destroy a event object. Return
 * osaStatus_Success if the event object is destroyed successfully, otherwise
 * return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_EventDestroy(osaEventId_t eventId)
{
    DEBUG("event destroy\n");
#if osNumberOfEvents
  return osaStatus_Success;
#else
  (void)eventId;
  return osaStatus_Error;
#endif
}

/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQCreate
 * Description   : This function is used to create a message queue.
 * Return        : the handle to the message queue if create successfully, otherwise
 * return NULL.
 *
 *END**************************************************************************/
osaMsgQId_t OSA_MsgQCreate( uint32_t  msgNo )
{
#if osNumberOfMessageQs
    msg_queue_handler_t msg_queue_handler;

    /* Create the message queue where each element is a pointer to the message item. */
    msg_queue_handler = xQueueCreate(msgNo,sizeof(osaMsg_t));
    return (osaMsgQId_t)msg_queue_handler;
#else
    (void)msgNo;
    return NULL;
#endif
}


/*FUNCTION**********************************************************************
 *
 * Function Name : OSA_MsgQPut
 * Description   : This function is used to put a message to a message queue.
* Return         : osaStatus_Success if the message is put successfully, otherwise return osaStatus_Error.
 *
 *END**************************************************************************/
osaStatus_t OSA_MsgQPut(osaMsgQId_t msgQId, void* pMessage)
{
#if osNumberOfMessageQs
  msg_queue_handler_t handler;
  osaStatus_t osaStatus;
  if(msgQId == NULL)
  {
    return osaStatus_Error;
  }
  handler = (msg_queue_handler_t)msgQId;
  {
    if (__get_IPSR())
    {
      portBASE_TYPE taskToWake = pdFALSE;

      if (pdTRUE == xQueueSendToBackFromISR(handler, pMessage, &taskToWake))
      {
        if (pdTRUE == taskToWake)
        {
          portYIELD_FROM_ISR(taskToWake);
        }
        osaStatus = osaStatus_Success;
      }
      else
      {
        osaStatus =  osaStatus_Error;
      }

